Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/BZ24/include/component/nvm.h
/**
 * \brief Component description for NVM
 *
 * Copyright (c) 2021 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2021-01-20T19:13:17Z */
#ifndef _BZ24_NVM_COMPONENT_H_
#define _BZ24_NVM_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR NVM                                          */
/* ************************************************************************** */

/* -------- NVM_NVMCON : (NVM Offset: 0x00) (R/W 32)  -------- */
#define NVM_NVMCON_RESETVALUE                 _U_(0x00)                                            /**<  (NVM_NVMCON)   Reset Value */

#define NVM_NVMCON_NVMOP_Pos                  _U_(0)                                               /**< (NVM_NVMCON)  Position */
#define NVM_NVMCON_NVMOP_Msk                  (_U_(0xF) << NVM_NVMCON_NVMOP_Pos)                   /**< (NVM_NVMCON)  Mask */
#define NVM_NVMCON_NVMOP(value)               (NVM_NVMCON_NVMOP_Msk & ((value) << NVM_NVMCON_NVMOP_Pos))
#define NVM_NVMCON_BFSWAP_Pos                 _U_(6)                                               /**< (NVM_NVMCON)  Position */
#define NVM_NVMCON_BFSWAP_Msk                 (_U_(0x1) << NVM_NVMCON_BFSWAP_Pos)                  /**< (NVM_NVMCON)  Mask */
#define NVM_NVMCON_BFSWAP(value)              (NVM_NVMCON_BFSWAP_Msk & ((value) << NVM_NVMCON_BFSWAP_Pos))
#define NVM_NVMCON_PFSWAP_Pos                 _U_(7)                                               /**< (NVM_NVMCON)  Position */
#define NVM_NVMCON_PFSWAP_Msk                 (_U_(0x1) << NVM_NVMCON_PFSWAP_Pos)                  /**< (NVM_NVMCON)  Mask */
#define NVM_NVMCON_PFSWAP(value)              (NVM_NVMCON_PFSWAP_Msk & ((value) << NVM_NVMCON_PFSWAP_Pos))
#define NVM_NVMCON_HTDPGM_Pos                 _U_(8)                                               /**< (NVM_NVMCON)  Position */
#define NVM_NVMCON_HTDPGM_Msk                 (_U_(0x1) << NVM_NVMCON_HTDPGM_Pos)                  /**< (NVM_NVMCON)  Mask */
#define NVM_NVMCON_HTDPGM(value)              (NVM_NVMCON_HTDPGM_Msk & ((value) << NVM_NVMCON_HTDPGM_Pos))
#define NVM_NVMCON_LVDERR_Pos                 _U_(12)                                              /**< (NVM_NVMCON)  Position */
#define NVM_NVMCON_LVDERR_Msk                 (_U_(0x1) << NVM_NVMCON_LVDERR_Pos)                  /**< (NVM_NVMCON)  Mask */
#define NVM_NVMCON_LVDERR(value)              (NVM_NVMCON_LVDERR_Msk & ((value) << NVM_NVMCON_LVDERR_Pos))
#define NVM_NVMCON_WRERR_Pos                  _U_(13)                                              /**< (NVM_NVMCON)  Position */
#define NVM_NVMCON_WRERR_Msk                  (_U_(0x1) << NVM_NVMCON_WRERR_Pos)                   /**< (NVM_NVMCON)  Mask */
#define NVM_NVMCON_WRERR(value)               (NVM_NVMCON_WRERR_Msk & ((value) << NVM_NVMCON_WRERR_Pos))
#define NVM_NVMCON_WREN_Pos                   _U_(14)                                              /**< (NVM_NVMCON)  Position */
#define NVM_NVMCON_WREN_Msk                   (_U_(0x1) << NVM_NVMCON_WREN_Pos)                    /**< (NVM_NVMCON)  Mask */
#define NVM_NVMCON_WREN(value)                (NVM_NVMCON_WREN_Msk & ((value) << NVM_NVMCON_WREN_Pos))
#define NVM_NVMCON_WR_Pos                     _U_(15)                                              /**< (NVM_NVMCON)  Position */
#define NVM_NVMCON_WR_Msk                     (_U_(0x1) << NVM_NVMCON_WR_Pos)                      /**< (NVM_NVMCON)  Mask */
#define NVM_NVMCON_WR(value)                  (NVM_NVMCON_WR_Msk & ((value) << NVM_NVMCON_WR_Pos))
#define NVM_NVMCON_Msk                        _U_(0x0000F1CF)                                      /**< (NVM_NVMCON) Register Mask  */


/* -------- NVM_NVMCONCLR : (NVM Offset: 0x04) (R/W 32)  -------- */
#define NVM_NVMCONCLR_RESETVALUE              _U_(0x00)                                            /**<  (NVM_NVMCONCLR)   Reset Value */

#define NVM_NVMCONCLR_Msk                     _U_(0x00000000)                                      /**< (NVM_NVMCONCLR) Register Mask  */


/* -------- NVM_NVMCONSET : (NVM Offset: 0x08) (R/W 32)  -------- */
#define NVM_NVMCONSET_RESETVALUE              _U_(0x00)                                            /**<  (NVM_NVMCONSET)   Reset Value */

#define NVM_NVMCONSET_Msk                     _U_(0x00000000)                                      /**< (NVM_NVMCONSET) Register Mask  */


/* -------- NVM_NVMCONINV : (NVM Offset: 0x0C) (R/W 32)  -------- */
#define NVM_NVMCONINV_RESETVALUE              _U_(0x00)                                            /**<  (NVM_NVMCONINV)   Reset Value */

#define NVM_NVMCONINV_Msk                     _U_(0x00000000)                                      /**< (NVM_NVMCONINV) Register Mask  */


/* -------- NVM_NVMCON2 : (NVM Offset: 0x10) (R/W 32)  -------- */
#define NVM_NVMCON2_RESETVALUE                _U_(0x00)                                            /**<  (NVM_NVMCON2)   Reset Value */

#define NVM_NVMCON2_PREPG_Pos                 _U_(0)                                               /**< (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_PREPG_Msk                 (_U_(0x1) << NVM_NVMCON2_PREPG_Pos)                  /**< (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_PREPG(value)              (NVM_NVMCON2_PREPG_Msk & ((value) << NVM_NVMCON2_PREPG_Pos))
#define NVM_NVMCON2_SWAPLK_Pos                _U_(6)                                               /**< (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_SWAPLK_Msk                (_U_(0x3) << NVM_NVMCON2_SWAPLK_Pos)                 /**< (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_SWAPLK(value)             (NVM_NVMCON2_SWAPLK_Msk & ((value) << NVM_NVMCON2_SWAPLK_Pos))
#define NVM_NVMCON2_RETRY_Pos                 _U_(8)                                               /**< (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_RETRY_Msk                 (_U_(0x3) << NVM_NVMCON2_RETRY_Pos)                  /**< (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_RETRY(value)              (NVM_NVMCON2_RETRY_Msk & ((value) << NVM_NVMCON2_RETRY_Pos))
#define NVM_NVMCON2_VREAD1_Pos                _U_(12)                                              /**< (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_VREAD1_Msk                (_U_(0x1) << NVM_NVMCON2_VREAD1_Pos)                 /**< (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_VREAD1(value)             (NVM_NVMCON2_VREAD1_Msk & ((value) << NVM_NVMCON2_VREAD1_Pos))
#define NVM_NVMCON2_CREAD1_Pos                _U_(13)                                              /**< (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_CREAD1_Msk                (_U_(0x1) << NVM_NVMCON2_CREAD1_Pos)                 /**< (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_CREAD1(value)             (NVM_NVMCON2_CREAD1_Msk & ((value) << NVM_NVMCON2_CREAD1_Pos))
#define NVM_NVMCON2_TEMP_Pos                  _U_(14)                                              /**< (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_TEMP_Msk                  (_U_(0x1) << NVM_NVMCON2_TEMP_Pos)                   /**< (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_TEMP(value)               (NVM_NVMCON2_TEMP_Msk & ((value) << NVM_NVMCON2_TEMP_Pos))
#define NVM_NVMCON2_WS_Pos                    _U_(16)                                              /**< (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_WS_Msk                    (_U_(0x1F) << NVM_NVMCON2_WS_Pos)                    /**< (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_WS(value)                 (NVM_NVMCON2_WS_Msk & ((value) << NVM_NVMCON2_WS_Pos))
#define NVM_NVMCON2_SLEEP_Pos                 _U_(24)                                              /**< (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_SLEEP_Msk                 (_U_(0x1) << NVM_NVMCON2_SLEEP_Pos)                  /**< (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_SLEEP(value)              (NVM_NVMCON2_SLEEP_Msk & ((value) << NVM_NVMCON2_SLEEP_Pos))
#define NVM_NVMCON2_ERS_Pos                   _U_(28)                                              /**< (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_ERS_Msk                   (_U_(0xF) << NVM_NVMCON2_ERS_Pos)                    /**< (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_ERS(value)                (NVM_NVMCON2_ERS_Msk & ((value) << NVM_NVMCON2_ERS_Pos))
#define NVM_NVMCON2_Msk                       _U_(0xF11F73C1)                                      /**< (NVM_NVMCON2) Register Mask  */

#define NVM_NVMCON2_VREAD_Pos                 _U_(12)                                              /**< (NVM_NVMCON2 Position)  */
#define NVM_NVMCON2_VREAD_Msk                 (_U_(0x1) << NVM_NVMCON2_VREAD_Pos)                  /**< (NVM_NVMCON2 Mask) VREAD */
#define NVM_NVMCON2_VREAD(value)              (NVM_NVMCON2_VREAD_Msk & ((value) << NVM_NVMCON2_VREAD_Pos)) 
#define NVM_NVMCON2_CREAD_Pos                 _U_(13)                                              /**< (NVM_NVMCON2 Position)  */
#define NVM_NVMCON2_CREAD_Msk                 (_U_(0x1) << NVM_NVMCON2_CREAD_Pos)                  /**< (NVM_NVMCON2 Mask) CREAD */
#define NVM_NVMCON2_CREAD(value)              (NVM_NVMCON2_CREAD_Msk & ((value) << NVM_NVMCON2_CREAD_Pos)) 

/* -------- NVM_NVMCON2CLR : (NVM Offset: 0x14) (R/W 32)  -------- */
#define NVM_NVMCON2CLR_RESETVALUE             _U_(0x00)                                            /**<  (NVM_NVMCON2CLR)   Reset Value */

