Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/BZ24/include/component/nvm.h
#define NVM_NVMCON2CLR_Msk                    _U_(0x00000000)                                      /**< (NVM_NVMCON2CLR) Register Mask  */


/* -------- NVM_NVMCON2SET : (NVM Offset: 0x18) (R/W 32)  -------- */
#define NVM_NVMCON2SET_RESETVALUE             _U_(0x00)                                            /**<  (NVM_NVMCON2SET)   Reset Value */

#define NVM_NVMCON2SET_Msk                    _U_(0x00000000)                                      /**< (NVM_NVMCON2SET) Register Mask  */


/* -------- NVM_NVMCON2INV : (NVM Offset: 0x1C) (R/W 32)  -------- */
#define NVM_NVMCON2INV_RESETVALUE             _U_(0x00)                                            /**<  (NVM_NVMCON2INV)   Reset Value */

#define NVM_NVMCON2INV_Msk                    _U_(0x00000000)                                      /**< (NVM_NVMCON2INV) Register Mask  */


/* -------- NVM_NVMKEY : (NVM Offset: 0x20) (R/W 32)  -------- */
#define NVM_NVMKEY_RESETVALUE                 _U_(0x00)                                            /**<  (NVM_NVMKEY)   Reset Value */

#define NVM_NVMKEY_NVMKEY_Pos                 _U_(0)                                               /**< (NVM_NVMKEY)  Position */
#define NVM_NVMKEY_NVMKEY_Msk                 (_U_(0xFFFFFFFF) << NVM_NVMKEY_NVMKEY_Pos)           /**< (NVM_NVMKEY)  Mask */
#define NVM_NVMKEY_NVMKEY(value)              (NVM_NVMKEY_NVMKEY_Msk & ((value) << NVM_NVMKEY_NVMKEY_Pos))
#define NVM_NVMKEY_Msk                        _U_(0xFFFFFFFF)                                      /**< (NVM_NVMKEY) Register Mask  */


/* -------- NVM_NVMADDR : (NVM Offset: 0x30) (R/W 32)  -------- */
#define NVM_NVMADDR_RESETVALUE                _U_(0x00)                                            /**<  (NVM_NVMADDR)   Reset Value */

#define NVM_NVMADDR_NVMADDR_Pos               _U_(0)                                               /**< (NVM_NVMADDR)  Position */
#define NVM_NVMADDR_NVMADDR_Msk               (_U_(0xFFFFFFFF) << NVM_NVMADDR_NVMADDR_Pos)         /**< (NVM_NVMADDR)  Mask */
#define NVM_NVMADDR_NVMADDR(value)            (NVM_NVMADDR_NVMADDR_Msk & ((value) << NVM_NVMADDR_NVMADDR_Pos))
#define NVM_NVMADDR_Msk                       _U_(0xFFFFFFFF)                                      /**< (NVM_NVMADDR) Register Mask  */


/* -------- NVM_NVMDATA0 : (NVM Offset: 0x40) (R/W 32)  -------- */
#define NVM_NVMDATA0_RESETVALUE               _U_(0x00)                                            /**<  (NVM_NVMDATA0)   Reset Value */

#define NVM_NVMDATA0_NVMDATA0_Pos             _U_(0)                                               /**< (NVM_NVMDATA0)  Position */
#define NVM_NVMDATA0_NVMDATA0_Msk             (_U_(0xFFFFFFFF) << NVM_NVMDATA0_NVMDATA0_Pos)       /**< (NVM_NVMDATA0)  Mask */
#define NVM_NVMDATA0_NVMDATA0(value)          (NVM_NVMDATA0_NVMDATA0_Msk & ((value) << NVM_NVMDATA0_NVMDATA0_Pos))
#define NVM_NVMDATA0_Msk                      _U_(0xFFFFFFFF)                                      /**< (NVM_NVMDATA0) Register Mask  */


/* -------- NVM_NVMDATA1 : (NVM Offset: 0x50) (R/W 32)  -------- */
#define NVM_NVMDATA1_RESETVALUE               _U_(0x00)                                            /**<  (NVM_NVMDATA1)   Reset Value */

#define NVM_NVMDATA1_NVMDATA1_Pos             _U_(0)                                               /**< (NVM_NVMDATA1)  Position */
#define NVM_NVMDATA1_NVMDATA1_Msk             (_U_(0xFFFFFFFF) << NVM_NVMDATA1_NVMDATA1_Pos)       /**< (NVM_NVMDATA1)  Mask */
#define NVM_NVMDATA1_NVMDATA1(value)          (NVM_NVMDATA1_NVMDATA1_Msk & ((value) << NVM_NVMDATA1_NVMDATA1_Pos))
#define NVM_NVMDATA1_Msk                      _U_(0xFFFFFFFF)                                      /**< (NVM_NVMDATA1) Register Mask  */


/* -------- NVM_NVMDATA2 : (NVM Offset: 0x60) (R/W 32)  -------- */
#define NVM_NVMDATA2_RESETVALUE               _U_(0x00)                                            /**<  (NVM_NVMDATA2)   Reset Value */

#define NVM_NVMDATA2_NVMDATA2_Pos             _U_(0)                                               /**< (NVM_NVMDATA2)  Position */
#define NVM_NVMDATA2_NVMDATA2_Msk             (_U_(0xFFFFFFFF) << NVM_NVMDATA2_NVMDATA2_Pos)       /**< (NVM_NVMDATA2)  Mask */
#define NVM_NVMDATA2_NVMDATA2(value)          (NVM_NVMDATA2_NVMDATA2_Msk & ((value) << NVM_NVMDATA2_NVMDATA2_Pos))
#define NVM_NVMDATA2_Msk                      _U_(0xFFFFFFFF)                                      /**< (NVM_NVMDATA2) Register Mask  */


/* -------- NVM_NVMDATA3 : (NVM Offset: 0x70) (R/W 32)  -------- */
#define NVM_NVMDATA3_RESETVALUE               _U_(0x00)                                            /**<  (NVM_NVMDATA3)   Reset Value */

#define NVM_NVMDATA3_NVMDATA3_Pos             _U_(0)                                               /**< (NVM_NVMDATA3)  Position */
#define NVM_NVMDATA3_NVMDATA3_Msk             (_U_(0xFFFFFFFF) << NVM_NVMDATA3_NVMDATA3_Pos)       /**< (NVM_NVMDATA3)  Mask */
#define NVM_NVMDATA3_NVMDATA3(value)          (NVM_NVMDATA3_NVMDATA3_Msk & ((value) << NVM_NVMDATA3_NVMDATA3_Pos))
#define NVM_NVMDATA3_Msk                      _U_(0xFFFFFFFF)                                      /**< (NVM_NVMDATA3) Register Mask  */


/* -------- NVM_NVMDATA4 : (NVM Offset: 0x80) (R/W 32)  -------- */
#define NVM_NVMDATA4_RESETVALUE               _U_(0x00)                                            /**<  (NVM_NVMDATA4)   Reset Value */

#define NVM_NVMDATA4_NVMDATA4_Pos             _U_(0)                                               /**< (NVM_NVMDATA4)  Position */
#define NVM_NVMDATA4_NVMDATA4_Msk             (_U_(0xFFFFFFFF) << NVM_NVMDATA4_NVMDATA4_Pos)       /**< (NVM_NVMDATA4)  Mask */
#define NVM_NVMDATA4_NVMDATA4(value)          (NVM_NVMDATA4_NVMDATA4_Msk & ((value) << NVM_NVMDATA4_NVMDATA4_Pos))
#define NVM_NVMDATA4_Msk                      _U_(0xFFFFFFFF)                                      /**< (NVM_NVMDATA4) Register Mask  */


/* -------- NVM_NVMDATA5 : (NVM Offset: 0x90) (R/W 32)  -------- */
#define NVM_NVMDATA5_RESETVALUE               _U_(0x00)                                            /**<  (NVM_NVMDATA5)   Reset Value */

