Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/BZ24/include/component/nvm.h
#define NVM_NVMDATA5_NVMDATA5_Pos             _U_(0)                                               /**< (NVM_NVMDATA5)  Position */
#define NVM_NVMDATA5_NVMDATA5_Msk             (_U_(0xFFFFFFFF) << NVM_NVMDATA5_NVMDATA5_Pos)       /**< (NVM_NVMDATA5)  Mask */
#define NVM_NVMDATA5_NVMDATA5(value)          (NVM_NVMDATA5_NVMDATA5_Msk & ((value) << NVM_NVMDATA5_NVMDATA5_Pos))
#define NVM_NVMDATA5_Msk                      _U_(0xFFFFFFFF)                                      /**< (NVM_NVMDATA5) Register Mask  */


/* -------- NVM_NVMDATA6 : (NVM Offset: 0xA0) (R/W 32)  -------- */
#define NVM_NVMDATA6_RESETVALUE               _U_(0x00)                                            /**<  (NVM_NVMDATA6)   Reset Value */

#define NVM_NVMDATA6_NVMDATA6_Pos             _U_(0)                                               /**< (NVM_NVMDATA6)  Position */
#define NVM_NVMDATA6_NVMDATA6_Msk             (_U_(0xFFFFFFFF) << NVM_NVMDATA6_NVMDATA6_Pos)       /**< (NVM_NVMDATA6)  Mask */
#define NVM_NVMDATA6_NVMDATA6(value)          (NVM_NVMDATA6_NVMDATA6_Msk & ((value) << NVM_NVMDATA6_NVMDATA6_Pos))
#define NVM_NVMDATA6_Msk                      _U_(0xFFFFFFFF)                                      /**< (NVM_NVMDATA6) Register Mask  */


/* -------- NVM_NVMDATA7 : (NVM Offset: 0xB0) (R/W 32)  -------- */
#define NVM_NVMDATA7_RESETVALUE               _U_(0x00)                                            /**<  (NVM_NVMDATA7)   Reset Value */

#define NVM_NVMDATA7_NVMDATA7_Pos             _U_(0)                                               /**< (NVM_NVMDATA7)  Position */
#define NVM_NVMDATA7_NVMDATA7_Msk             (_U_(0xFFFFFFFF) << NVM_NVMDATA7_NVMDATA7_Pos)       /**< (NVM_NVMDATA7)  Mask */
#define NVM_NVMDATA7_NVMDATA7(value)          (NVM_NVMDATA7_NVMDATA7_Msk & ((value) << NVM_NVMDATA7_NVMDATA7_Pos))
#define NVM_NVMDATA7_Msk                      _U_(0xFFFFFFFF)                                      /**< (NVM_NVMDATA7) Register Mask  */


/* -------- NVM_NVMSRCADDR : (NVM Offset: 0xC0) (R/W 32)  -------- */
#define NVM_NVMSRCADDR_RESETVALUE             _U_(0x00)                                            /**<  (NVM_NVMSRCADDR)   Reset Value */

#define NVM_NVMSRCADDR_NVMSRCADDR_Pos         _U_(0)                                               /**< (NVM_NVMSRCADDR)  Position */
#define NVM_NVMSRCADDR_NVMSRCADDR_Msk         (_U_(0xFFFFFFFF) << NVM_NVMSRCADDR_NVMSRCADDR_Pos)   /**< (NVM_NVMSRCADDR)  Mask */
#define NVM_NVMSRCADDR_NVMSRCADDR(value)      (NVM_NVMSRCADDR_NVMSRCADDR_Msk & ((value) << NVM_NVMSRCADDR_NVMSRCADDR_Pos))
#define NVM_NVMSRCADDR_Msk                    _U_(0xFFFFFFFF)                                      /**< (NVM_NVMSRCADDR) Register Mask  */


/* -------- NVM_NVMPWPLT : (NVM Offset: 0xD0) (R/W 32)  -------- */
#define NVM_NVMPWPLT_RESETVALUE               _U_(0x00)                                            /**<  (NVM_NVMPWPLT)   Reset Value */

#define NVM_NVMPWPLT_PWPLT_Pos                _U_(0)                                               /**< (NVM_NVMPWPLT)  Position */
#define NVM_NVMPWPLT_PWPLT_Msk                (_U_(0xFFFFFF) << NVM_NVMPWPLT_PWPLT_Pos)            /**< (NVM_NVMPWPLT)  Mask */
#define NVM_NVMPWPLT_PWPLT(value)             (NVM_NVMPWPLT_PWPLT_Msk & ((value) << NVM_NVMPWPLT_PWPLT_Pos))
#define NVM_NVMPWPLT_ULOCK_Pos                _U_(31)                                              /**< (NVM_NVMPWPLT)  Position */
#define NVM_NVMPWPLT_ULOCK_Msk                (_U_(0x1) << NVM_NVMPWPLT_ULOCK_Pos)                 /**< (NVM_NVMPWPLT)  Mask */
#define NVM_NVMPWPLT_ULOCK(value)             (NVM_NVMPWPLT_ULOCK_Msk & ((value) << NVM_NVMPWPLT_ULOCK_Pos))
#define NVM_NVMPWPLT_Msk                      _U_(0x80FFFFFF)                                      /**< (NVM_NVMPWPLT) Register Mask  */


/* -------- NVM_NVMPWPLTCLR : (NVM Offset: 0xD4) (R/W 32)  -------- */
#define NVM_NVMPWPLTCLR_RESETVALUE            _U_(0x00)                                            /**<  (NVM_NVMPWPLTCLR)   Reset Value */

#define NVM_NVMPWPLTCLR_Msk                   _U_(0x00000000)                                      /**< (NVM_NVMPWPLTCLR) Register Mask  */


/* -------- NVM_NVMPWPLTSET : (NVM Offset: 0xD8) (R/W 32)  -------- */
#define NVM_NVMPWPLTSET_RESETVALUE            _U_(0x00)                                            /**<  (NVM_NVMPWPLTSET)   Reset Value */

#define NVM_NVMPWPLTSET_Msk                   _U_(0x00000000)                                      /**< (NVM_NVMPWPLTSET) Register Mask  */


/* -------- NVM_NVMPWPLTINV : (NVM Offset: 0xDC) (R/W 32)  -------- */
#define NVM_NVMPWPLTINV_RESETVALUE            _U_(0x00)                                            /**<  (NVM_NVMPWPLTINV)   Reset Value */

#define NVM_NVMPWPLTINV_Msk                   _U_(0x00000000)                                      /**< (NVM_NVMPWPLTINV) Register Mask  */


/* -------- NVM_NVMPWPGTE : (NVM Offset: 0xE0) (R/W 32)  -------- */
#define NVM_NVMPWPGTE_RESETVALUE              _U_(0x00)                                            /**<  (NVM_NVMPWPGTE)   Reset Value */

#define NVM_NVMPWPGTE_PWPGTE_Pos              _U_(0)                                               /**< (NVM_NVMPWPGTE)  Position */
#define NVM_NVMPWPGTE_PWPGTE_Msk              (_U_(0xFFFFFF) << NVM_NVMPWPGTE_PWPGTE_Pos)          /**< (NVM_NVMPWPGTE)  Mask */
#define NVM_NVMPWPGTE_PWPGTE(value)           (NVM_NVMPWPGTE_PWPGTE_Msk & ((value) << NVM_NVMPWPGTE_PWPGTE_Pos))
#define NVM_NVMPWPGTE_ULOCK_Pos               _U_(31)                                              /**< (NVM_NVMPWPGTE)  Position */
#define NVM_NVMPWPGTE_ULOCK_Msk               (_U_(0x1) << NVM_NVMPWPGTE_ULOCK_Pos)                /**< (NVM_NVMPWPGTE)  Mask */
#define NVM_NVMPWPGTE_ULOCK(value)            (NVM_NVMPWPGTE_ULOCK_Msk & ((value) << NVM_NVMPWPGTE_ULOCK_Pos))
#define NVM_NVMPWPGTE_Msk                     _U_(0x80FFFFFF)                                      /**< (NVM_NVMPWPGTE) Register Mask  */


/* -------- NVM_NVMPWPGTECLR : (NVM Offset: 0xE4) (R/W 32)  -------- */
#define NVM_NVMPWPGTECLR_RESETVALUE           _U_(0x00)                                            /**<  (NVM_NVMPWPGTECLR)   Reset Value */

#define NVM_NVMPWPGTECLR_Msk                  _U_(0x00000000)                                      /**< (NVM_NVMPWPGTECLR) Register Mask  */


/* -------- NVM_NVMPWPGTESET : (NVM Offset: 0xE8) (R/W 32)  -------- */
#define NVM_NVMPWPGTESET_RESETVALUE           _U_(0x00)                                            /**<  (NVM_NVMPWPGTESET)   Reset Value */

#define NVM_NVMPWPGTESET_Msk                  _U_(0x00000000)                                      /**< (NVM_NVMPWPGTESET) Register Mask  */


