Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/BZ24/include/component/nvm.h
/* -------- NVM_NVMPWPGTEINV : (NVM Offset: 0xEC) (R/W 32)  -------- */
#define NVM_NVMPWPGTEINV_RESETVALUE           _U_(0x00)                                            /**<  (NVM_NVMPWPGTEINV)   Reset Value */

#define NVM_NVMPWPGTEINV_Msk                  _U_(0x00000000)                                      /**< (NVM_NVMPWPGTEINV) Register Mask  */


/* -------- NVM_NVMLBWP : (NVM Offset: 0xF0) (R/W 32)  -------- */
#define NVM_NVMLBWP_RESETVALUE                _U_(0x00)                                            /**<  (NVM_NVMLBWP)   Reset Value */

#define NVM_NVMLBWP_LBWP0_Pos                 _U_(0)                                               /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP0_Msk                 (_U_(0x1) << NVM_NVMLBWP_LBWP0_Pos)                  /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP0(value)              (NVM_NVMLBWP_LBWP0_Msk & ((value) << NVM_NVMLBWP_LBWP0_Pos))
#define NVM_NVMLBWP_LBWP1_Pos                 _U_(1)                                               /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP1_Msk                 (_U_(0x1) << NVM_NVMLBWP_LBWP1_Pos)                  /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP1(value)              (NVM_NVMLBWP_LBWP1_Msk & ((value) << NVM_NVMLBWP_LBWP1_Pos))
#define NVM_NVMLBWP_LBWP2_Pos                 _U_(2)                                               /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP2_Msk                 (_U_(0x1) << NVM_NVMLBWP_LBWP2_Pos)                  /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP2(value)              (NVM_NVMLBWP_LBWP2_Msk & ((value) << NVM_NVMLBWP_LBWP2_Pos))
#define NVM_NVMLBWP_LBWP3_Pos                 _U_(3)                                               /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP3_Msk                 (_U_(0x1) << NVM_NVMLBWP_LBWP3_Pos)                  /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP3(value)              (NVM_NVMLBWP_LBWP3_Msk & ((value) << NVM_NVMLBWP_LBWP3_Pos))
#define NVM_NVMLBWP_LBWP4_Pos                 _U_(4)                                               /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP4_Msk                 (_U_(0x1) << NVM_NVMLBWP_LBWP4_Pos)                  /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP4(value)              (NVM_NVMLBWP_LBWP4_Msk & ((value) << NVM_NVMLBWP_LBWP4_Pos))
#define NVM_NVMLBWP_LBWP5_Pos                 _U_(5)                                               /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP5_Msk                 (_U_(0x1) << NVM_NVMLBWP_LBWP5_Pos)                  /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP5(value)              (NVM_NVMLBWP_LBWP5_Msk & ((value) << NVM_NVMLBWP_LBWP5_Pos))
#define NVM_NVMLBWP_LBWP6_Pos                 _U_(6)                                               /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP6_Msk                 (_U_(0x1) << NVM_NVMLBWP_LBWP6_Pos)                  /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP6(value)              (NVM_NVMLBWP_LBWP6_Msk & ((value) << NVM_NVMLBWP_LBWP6_Pos))
#define NVM_NVMLBWP_LBWP7_Pos                 _U_(7)                                               /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP7_Msk                 (_U_(0x1) << NVM_NVMLBWP_LBWP7_Pos)                  /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP7(value)              (NVM_NVMLBWP_LBWP7_Msk & ((value) << NVM_NVMLBWP_LBWP7_Pos))
#define NVM_NVMLBWP_LBWP8_Pos                 _U_(8)                                               /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP8_Msk                 (_U_(0x1) << NVM_NVMLBWP_LBWP8_Pos)                  /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP8(value)              (NVM_NVMLBWP_LBWP8_Msk & ((value) << NVM_NVMLBWP_LBWP8_Pos))
#define NVM_NVMLBWP_LBWP9_Pos                 _U_(9)                                               /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP9_Msk                 (_U_(0x1) << NVM_NVMLBWP_LBWP9_Pos)                  /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP9(value)              (NVM_NVMLBWP_LBWP9_Msk & ((value) << NVM_NVMLBWP_LBWP9_Pos))
#define NVM_NVMLBWP_LBWP10_Pos                _U_(10)                                              /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP10_Msk                (_U_(0x1) << NVM_NVMLBWP_LBWP10_Pos)                 /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP10(value)             (NVM_NVMLBWP_LBWP10_Msk & ((value) << NVM_NVMLBWP_LBWP10_Pos))
#define NVM_NVMLBWP_LBWP11_Pos                _U_(11)                                              /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP11_Msk                (_U_(0x1) << NVM_NVMLBWP_LBWP11_Pos)                 /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP11(value)             (NVM_NVMLBWP_LBWP11_Msk & ((value) << NVM_NVMLBWP_LBWP11_Pos))
#define NVM_NVMLBWP_LBWP12_Pos                _U_(12)                                              /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP12_Msk                (_U_(0x1) << NVM_NVMLBWP_LBWP12_Pos)                 /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP12(value)             (NVM_NVMLBWP_LBWP12_Msk & ((value) << NVM_NVMLBWP_LBWP12_Pos))
#define NVM_NVMLBWP_LBWP13_Pos                _U_(13)                                              /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP13_Msk                (_U_(0x1) << NVM_NVMLBWP_LBWP13_Pos)                 /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP13(value)             (NVM_NVMLBWP_LBWP13_Msk & ((value) << NVM_NVMLBWP_LBWP13_Pos))
#define NVM_NVMLBWP_LBWP14_Pos                _U_(14)                                              /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP14_Msk                (_U_(0x1) << NVM_NVMLBWP_LBWP14_Pos)                 /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP14(value)             (NVM_NVMLBWP_LBWP14_Msk & ((value) << NVM_NVMLBWP_LBWP14_Pos))
#define NVM_NVMLBWP_LBWP15_Pos                _U_(15)                                              /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP15_Msk                (_U_(0x1) << NVM_NVMLBWP_LBWP15_Pos)                 /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP15(value)             (NVM_NVMLBWP_LBWP15_Msk & ((value) << NVM_NVMLBWP_LBWP15_Pos))
#define NVM_NVMLBWP_LBWP16_Pos                _U_(16)                                              /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP16_Msk                (_U_(0x1) << NVM_NVMLBWP_LBWP16_Pos)                 /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP16(value)             (NVM_NVMLBWP_LBWP16_Msk & ((value) << NVM_NVMLBWP_LBWP16_Pos))
#define NVM_NVMLBWP_LBWP17_Pos                _U_(17)                                              /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP17_Msk                (_U_(0x1) << NVM_NVMLBWP_LBWP17_Pos)                 /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP17(value)             (NVM_NVMLBWP_LBWP17_Msk & ((value) << NVM_NVMLBWP_LBWP17_Pos))
#define NVM_NVMLBWP_LBWP18_Pos                _U_(18)                                              /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP18_Msk                (_U_(0x1) << NVM_NVMLBWP_LBWP18_Pos)                 /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP18(value)             (NVM_NVMLBWP_LBWP18_Msk & ((value) << NVM_NVMLBWP_LBWP18_Pos))
#define NVM_NVMLBWP_LBWP19_Pos                _U_(19)                                              /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP19_Msk                (_U_(0x1) << NVM_NVMLBWP_LBWP19_Pos)                 /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP19(value)             (NVM_NVMLBWP_LBWP19_Msk & ((value) << NVM_NVMLBWP_LBWP19_Pos))
#define NVM_NVMLBWP_LBWP20_Pos                _U_(20)                                              /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP20_Msk                (_U_(0x1) << NVM_NVMLBWP_LBWP20_Pos)                 /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP20(value)             (NVM_NVMLBWP_LBWP20_Msk & ((value) << NVM_NVMLBWP_LBWP20_Pos))
#define NVM_NVMLBWP_LBWP21_Pos                _U_(21)                                              /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP21_Msk                (_U_(0x1) << NVM_NVMLBWP_LBWP21_Pos)                 /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP21(value)             (NVM_NVMLBWP_LBWP21_Msk & ((value) << NVM_NVMLBWP_LBWP21_Pos))
#define NVM_NVMLBWP_LBWP22_Pos                _U_(22)                                              /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP22_Msk                (_U_(0x1) << NVM_NVMLBWP_LBWP22_Pos)                 /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP22(value)             (NVM_NVMLBWP_LBWP22_Msk & ((value) << NVM_NVMLBWP_LBWP22_Pos))
#define NVM_NVMLBWP_LBWP23_Pos                _U_(23)                                              /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP23_Msk                (_U_(0x1) << NVM_NVMLBWP_LBWP23_Pos)                 /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP23(value)             (NVM_NVMLBWP_LBWP23_Msk & ((value) << NVM_NVMLBWP_LBWP23_Pos))
#define NVM_NVMLBWP_ULOCK_Pos                 _U_(31)                                              /**< (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_ULOCK_Msk                 (_U_(0x1) << NVM_NVMLBWP_ULOCK_Pos)                  /**< (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_ULOCK(value)              (NVM_NVMLBWP_ULOCK_Msk & ((value) << NVM_NVMLBWP_ULOCK_Pos))
#define NVM_NVMLBWP_Msk                       _U_(0x80FFFFFF)                                      /**< (NVM_NVMLBWP) Register Mask  */

#define NVM_NVMLBWP_LBWP_Pos                  _U_(0)                                               /**< (NVM_NVMLBWP Position)  */
#define NVM_NVMLBWP_LBWP_Msk                  (_U_(0xFFFFFF) << NVM_NVMLBWP_LBWP_Pos)              /**< (NVM_NVMLBWP Mask) LBWP */
#define NVM_NVMLBWP_LBWP(value)               (NVM_NVMLBWP_LBWP_Msk & ((value) << NVM_NVMLBWP_LBWP_Pos)) 

/* -------- NVM_NVMLBWPCLR : (NVM Offset: 0xF4) (R/W 32)  -------- */
#define NVM_NVMLBWPCLR_RESETVALUE             _U_(0x00)                                            /**<  (NVM_NVMLBWPCLR)   Reset Value */

#define NVM_NVMLBWPCLR_Msk                    _U_(0x00000000)                                      /**< (NVM_NVMLBWPCLR) Register Mask  */


/* -------- NVM_NVMLBWPSET : (NVM Offset: 0xF8) (R/W 32)  -------- */
#define NVM_NVMLBWPSET_RESETVALUE             _U_(0x00)                                            /**<  (NVM_NVMLBWPSET)   Reset Value */

