Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/BZ24/include/component/nvm.h
#define NVM_NVMLBWPSET_Msk                    _U_(0x00000000)                                      /**< (NVM_NVMLBWPSET) Register Mask  */


/* -------- NVM_NVMLBWPINV : (NVM Offset: 0xFC) (R/W 32)  -------- */
#define NVM_NVMLBWPINV_RESETVALUE             _U_(0x00)                                            /**<  (NVM_NVMLBWPINV)   Reset Value */

#define NVM_NVMLBWPINV_Msk                    _U_(0x00000000)                                      /**< (NVM_NVMLBWPINV) Register Mask  */


/* -------- NVM_NVMUBWP : (NVM Offset: 0x100) (R/W 32)  -------- */
#define NVM_NVMUBWP_RESETVALUE                _U_(0x00)                                            /**<  (NVM_NVMUBWP)   Reset Value */

#define NVM_NVMUBWP_UBWP0_Pos                 _U_(0)                                               /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP0_Msk                 (_U_(0x1) << NVM_NVMUBWP_UBWP0_Pos)                  /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP0(value)              (NVM_NVMUBWP_UBWP0_Msk & ((value) << NVM_NVMUBWP_UBWP0_Pos))
#define NVM_NVMUBWP_UBWP1_Pos                 _U_(1)                                               /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP1_Msk                 (_U_(0x1) << NVM_NVMUBWP_UBWP1_Pos)                  /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP1(value)              (NVM_NVMUBWP_UBWP1_Msk & ((value) << NVM_NVMUBWP_UBWP1_Pos))
#define NVM_NVMUBWP_UBWP2_Pos                 _U_(2)                                               /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP2_Msk                 (_U_(0x1) << NVM_NVMUBWP_UBWP2_Pos)                  /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP2(value)              (NVM_NVMUBWP_UBWP2_Msk & ((value) << NVM_NVMUBWP_UBWP2_Pos))
#define NVM_NVMUBWP_UBWP3_Pos                 _U_(3)                                               /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP3_Msk                 (_U_(0x1) << NVM_NVMUBWP_UBWP3_Pos)                  /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP3(value)              (NVM_NVMUBWP_UBWP3_Msk & ((value) << NVM_NVMUBWP_UBWP3_Pos))
#define NVM_NVMUBWP_UBWP4_Pos                 _U_(4)                                               /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP4_Msk                 (_U_(0x1) << NVM_NVMUBWP_UBWP4_Pos)                  /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP4(value)              (NVM_NVMUBWP_UBWP4_Msk & ((value) << NVM_NVMUBWP_UBWP4_Pos))
#define NVM_NVMUBWP_UBWP5_Pos                 _U_(5)                                               /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP5_Msk                 (_U_(0x1) << NVM_NVMUBWP_UBWP5_Pos)                  /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP5(value)              (NVM_NVMUBWP_UBWP5_Msk & ((value) << NVM_NVMUBWP_UBWP5_Pos))
#define NVM_NVMUBWP_UBWP6_Pos                 _U_(6)                                               /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP6_Msk                 (_U_(0x1) << NVM_NVMUBWP_UBWP6_Pos)                  /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP6(value)              (NVM_NVMUBWP_UBWP6_Msk & ((value) << NVM_NVMUBWP_UBWP6_Pos))
#define NVM_NVMUBWP_UBWP7_Pos                 _U_(7)                                               /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP7_Msk                 (_U_(0x1) << NVM_NVMUBWP_UBWP7_Pos)                  /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP7(value)              (NVM_NVMUBWP_UBWP7_Msk & ((value) << NVM_NVMUBWP_UBWP7_Pos))
#define NVM_NVMUBWP_UBWP8_Pos                 _U_(8)                                               /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP8_Msk                 (_U_(0x1) << NVM_NVMUBWP_UBWP8_Pos)                  /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP8(value)              (NVM_NVMUBWP_UBWP8_Msk & ((value) << NVM_NVMUBWP_UBWP8_Pos))
#define NVM_NVMUBWP_UBWP9_Pos                 _U_(9)                                               /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP9_Msk                 (_U_(0x1) << NVM_NVMUBWP_UBWP9_Pos)                  /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP9(value)              (NVM_NVMUBWP_UBWP9_Msk & ((value) << NVM_NVMUBWP_UBWP9_Pos))
#define NVM_NVMUBWP_UBWP10_Pos                _U_(10)                                              /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP10_Msk                (_U_(0x1) << NVM_NVMUBWP_UBWP10_Pos)                 /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP10(value)             (NVM_NVMUBWP_UBWP10_Msk & ((value) << NVM_NVMUBWP_UBWP10_Pos))
#define NVM_NVMUBWP_UBWP11_Pos                _U_(11)                                              /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP11_Msk                (_U_(0x1) << NVM_NVMUBWP_UBWP11_Pos)                 /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP11(value)             (NVM_NVMUBWP_UBWP11_Msk & ((value) << NVM_NVMUBWP_UBWP11_Pos))
#define NVM_NVMUBWP_UBWP12_Pos                _U_(12)                                              /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP12_Msk                (_U_(0x1) << NVM_NVMUBWP_UBWP12_Pos)                 /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP12(value)             (NVM_NVMUBWP_UBWP12_Msk & ((value) << NVM_NVMUBWP_UBWP12_Pos))
#define NVM_NVMUBWP_UBWP13_Pos                _U_(13)                                              /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP13_Msk                (_U_(0x1) << NVM_NVMUBWP_UBWP13_Pos)                 /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP13(value)             (NVM_NVMUBWP_UBWP13_Msk & ((value) << NVM_NVMUBWP_UBWP13_Pos))
#define NVM_NVMUBWP_UBWP14_Pos                _U_(14)                                              /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP14_Msk                (_U_(0x1) << NVM_NVMUBWP_UBWP14_Pos)                 /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP14(value)             (NVM_NVMUBWP_UBWP14_Msk & ((value) << NVM_NVMUBWP_UBWP14_Pos))
#define NVM_NVMUBWP_UBWP15_Pos                _U_(15)                                              /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP15_Msk                (_U_(0x1) << NVM_NVMUBWP_UBWP15_Pos)                 /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP15(value)             (NVM_NVMUBWP_UBWP15_Msk & ((value) << NVM_NVMUBWP_UBWP15_Pos))
#define NVM_NVMUBWP_UBWP16_Pos                _U_(16)                                              /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP16_Msk                (_U_(0x1) << NVM_NVMUBWP_UBWP16_Pos)                 /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP16(value)             (NVM_NVMUBWP_UBWP16_Msk & ((value) << NVM_NVMUBWP_UBWP16_Pos))
#define NVM_NVMUBWP_UBWP17_Pos                _U_(17)                                              /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP17_Msk                (_U_(0x1) << NVM_NVMUBWP_UBWP17_Pos)                 /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP17(value)             (NVM_NVMUBWP_UBWP17_Msk & ((value) << NVM_NVMUBWP_UBWP17_Pos))
#define NVM_NVMUBWP_UBWP18_Pos                _U_(18)                                              /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP18_Msk                (_U_(0x1) << NVM_NVMUBWP_UBWP18_Pos)                 /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP18(value)             (NVM_NVMUBWP_UBWP18_Msk & ((value) << NVM_NVMUBWP_UBWP18_Pos))
#define NVM_NVMUBWP_UBWP19_Pos                _U_(19)                                              /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP19_Msk                (_U_(0x1) << NVM_NVMUBWP_UBWP19_Pos)                 /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP19(value)             (NVM_NVMUBWP_UBWP19_Msk & ((value) << NVM_NVMUBWP_UBWP19_Pos))
#define NVM_NVMUBWP_UBWP20_Pos                _U_(20)                                              /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP20_Msk                (_U_(0x1) << NVM_NVMUBWP_UBWP20_Pos)                 /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP20(value)             (NVM_NVMUBWP_UBWP20_Msk & ((value) << NVM_NVMUBWP_UBWP20_Pos))
#define NVM_NVMUBWP_UBWP21_Pos                _U_(21)                                              /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP21_Msk                (_U_(0x1) << NVM_NVMUBWP_UBWP21_Pos)                 /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP21(value)             (NVM_NVMUBWP_UBWP21_Msk & ((value) << NVM_NVMUBWP_UBWP21_Pos))
#define NVM_NVMUBWP_UBWP22_Pos                _U_(22)                                              /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP22_Msk                (_U_(0x1) << NVM_NVMUBWP_UBWP22_Pos)                 /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP22(value)             (NVM_NVMUBWP_UBWP22_Msk & ((value) << NVM_NVMUBWP_UBWP22_Pos))
#define NVM_NVMUBWP_UBWP23_Pos                _U_(23)                                              /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP23_Msk                (_U_(0x1) << NVM_NVMUBWP_UBWP23_Pos)                 /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP23(value)             (NVM_NVMUBWP_UBWP23_Msk & ((value) << NVM_NVMUBWP_UBWP23_Pos))
#define NVM_NVMUBWP_ULOCK_Pos                 _U_(31)                                              /**< (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_ULOCK_Msk                 (_U_(0x1) << NVM_NVMUBWP_ULOCK_Pos)                  /**< (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_ULOCK(value)              (NVM_NVMUBWP_ULOCK_Msk & ((value) << NVM_NVMUBWP_ULOCK_Pos))
#define NVM_NVMUBWP_Msk                       _U_(0x80FFFFFF)                                      /**< (NVM_NVMUBWP) Register Mask  */

#define NVM_NVMUBWP_UBWP_Pos                  _U_(0)                                               /**< (NVM_NVMUBWP Position)  */
#define NVM_NVMUBWP_UBWP_Msk                  (_U_(0xFFFFFF) << NVM_NVMUBWP_UBWP_Pos)              /**< (NVM_NVMUBWP Mask) UBWP */
#define NVM_NVMUBWP_UBWP(value)               (NVM_NVMUBWP_UBWP_Msk & ((value) << NVM_NVMUBWP_UBWP_Pos)) 

/* -------- NVM_NVMUBWPCLR : (NVM Offset: 0x104) (R/W 32)  -------- */
#define NVM_NVMUBWPCLR_RESETVALUE             _U_(0x00)                                            /**<  (NVM_NVMUBWPCLR)   Reset Value */

#define NVM_NVMUBWPCLR_Msk                    _U_(0x00000000)                                      /**< (NVM_NVMUBWPCLR) Register Mask  */


/* -------- NVM_NVMUBWPSET : (NVM Offset: 0x108) (R/W 32)  -------- */
#define NVM_NVMUBWPSET_RESETVALUE             _U_(0x00)                                            /**<  (NVM_NVMUBWPSET)   Reset Value */

